iarsystems/ewarm-toshiba-example-projects/TMPM4NQ/Libraries/TMPM4NN.h
/**
  * @brief Interrupt Control Registers A
  */
typedef struct
{
  __IO uint8_t  NIC00;             /*!< Non-maskable Interrupt A Control Register 00 */
       uint8_t  RESERVED0[31];
  __IO uint8_t  IMC00;             /*!< Interrupt A Mode Control Register 00         */
  __IO uint8_t  IMC01;             /*!< Interrupt A Mode Control Register 01         */
  __IO uint8_t  IMC02;             /*!< Interrupt A Mode Control Register 02         */
       uint8_t  RESERVED1;
  __IO uint8_t  IMC04;             /*!< Interrupt A Mode Control Register 04         */
       uint8_t  RESERVED2[3];
  __IO uint8_t  IMC08;             /*!< Interrupt A Mode Control Register 08         */
  __IO uint8_t  IMC09;             /*!< Interrupt A Mode Control Register 09         */
  __IO uint8_t  IMC10;             /*!< Interrupt A Mode Control Register 10         */
  __IO uint8_t  IMC11;             /*!< Interrupt A Mode Control Register 11         */
       uint8_t  RESERVED3[4];
  __IO uint8_t  IMC16;             /*!< Interrupt A Mode Control Register 16         */
       uint8_t  RESERVED4;
  __IO uint8_t  IMC18;             /*!< Interrupt A Mode Control Register 18         */
       uint8_t  RESERVED5;
  __IO uint8_t  IMC20;             /*!< Interrupt A Mode Control Register 20         */
  __IO uint8_t  IMC21;             /*!< Interrupt A Mode Control Register 21         */
  __IO uint8_t  IMC22;             /*!< Interrupt A Mode Control Register 22         */
  __IO uint8_t  IMC23;             /*!< Interrupt A Mode Control Register 23         */
       uint8_t  RESERVED6[25];
  __IO uint8_t  IMC49;             /*!< Interrupt A Mode Control Register 49         */
       uint8_t  RESERVED7[2];
  __IO uint8_t  IMC52;             /*!< Interrupt A Mode Control Register 52         */
       uint8_t  RESERVED8[2];
  __IO uint8_t  IMC55;             /*!< Interrupt A Mode Control Register 55         */
       uint8_t  RESERVED9;
  __IO uint8_t  IMC57;             /*!< Interrupt A Mode Control Register 57         */
} TSB_IA_TypeDef;

/**
  * @brief Low speed oscillation/power control/reset
  */
typedef struct
{
  __IO uint8_t  LOSCCR;            /*!< Low speed oscillation and Internal High speed oscillation 2 clock control register*/
  __IO uint8_t  SHTDNOP;           /*!< Power supply cut off control register        */
  __IO uint8_t  RSTFLG0;           /*!< Reset flag register 0                        */
  __IO uint8_t  RSTFLG1;           /*!< Reset flag register 1                        */
       uint8_t  RESERVED0[11];
  __IO uint8_t  PROTECT;           /*!< RLM write protection register                */
} TSB_RLM_TypeDef;

/**
  * @brief LVD0
  */
typedef struct
{
  __IO uint8_t  CR1;               /*!< LVD Control Register1                        */
  __IO uint8_t  CR2;               /*!< LVD Control Register2                        */
  __IO uint8_t  LVL1;              /*!< LVD Detection Voltage Select Register 1      */
       uint8_t  RESERVED0;
  __I  uint8_t  SR;                /*!< LVD Status Register                          */
} TSB_LVD_TypeDef;

/**
  * @brief TRGSEL
  */
typedef struct
{
  __IO uint32_t CR0;               /*!< TRGSEL Control register 0                    */
  __IO uint32_t CR1;               /*!< TRGSEL Control register 1                    */
  __IO uint32_t CR2;               /*!< TSEL Control register 2                      */
  __IO uint32_t CR3;               /*!< TRGSEL Control register 3                    */
  __IO uint32_t CR4;               /*!< TRGSEL Control register 4                    */
  __IO uint32_t CR5;               /*!< TRGSEL Control register 5                    */
  __IO uint32_t CR6;               /*!< TRGSEL Control register 6                    */
  __IO uint32_t CR7;               /*!< TRGSEL Control register 7                    */
  __IO uint32_t CR8;               /*!< TRGSEL Control register 8                    */
  __IO uint32_t CR9;               /*!< TRGSEL Control register 9                    */
  __IO uint32_t CR10;              /*!< TRGSEL Control register 10                   */
  __IO uint32_t CR11;              /*!< TRGSEL Control register 11                   */
  __IO uint32_t CR12;              /*!< TRGSEL Control register 12                   */
  __IO uint32_t CR13;              /*!< TRGSEL Control register 13                   */
  __IO uint32_t CR14;              /*!< TRGSEL Control register 14                   */
} TSB_TSEL_TypeDef;

/**
  * @brief Long Term Timer(LTTMR)
  */
typedef struct
{
  __IO uint8_t  CR0;               /*!< LTTMR Control Register                       */
  __IO uint8_t  VALL;              /*!< LTTMR Data Register (Lower)                  */
  __IO uint8_t  VALH;              /*!< LTTMR Data Register (Upper)                  */
} TSB_LTT_TypeDef;

/**
  * @brief Serial Interface (TSPI)
  */
typedef struct
{
  __IO uint32_t CR0;               /*!< TSPI Control Register 0                      */
  __IO uint32_t CR1;               /*!< TSPI Control Register 1                      */
  __IO uint32_t CR2;               /*!< TSPI Control Register 2                      */
  __IO uint32_t CR3;               /*!< TSPI Control Register 3                      */
  __IO uint32_t BR;                /*!< TSPI Baud Rate Register                      */
  __IO uint32_t FMTR0;             /*!< TSPI Format Control Register 0               */
  __IO uint32_t FMTR1;             /*!< TSPI Format Control Register 1               */
  __IO uint32_t SECTCR0;           /*!< TSPI Sector mode Control Register 0          */
  __IO uint32_t SECTCR1;           /*!< TSPI Sector mode Control Register 1          */
       uint32_t RESERVED0[55];
  __IO uint32_t DR;                /*!< TSPI Data Register                           */
       uint32_t RESERVED1[63];
  __IO uint32_t SR;                /*!< TSPI Status Register                         */
  __IO uint32_t ERR;               /*!< TSPI Error Flag Register                     */
} TSB_TSPI_TypeDef;

/**
  * @brief External Bus Interface(EXB)
  */
typedef struct
{
  __IO uint32_t MOD;               /*!< EBIF Mode Control Register                   */
       uint32_t RESERVED0[3];
  __IO uint32_t AS0;               /*!< EBIF Area and Start Address Configuration Register 0*/
  __IO uint32_t AS1;               /*!< EBIF Area and Start Address Configuration Register 1*/
  __IO uint32_t AS2;               /*!< EBIF Area and Start Address Configuration Register 2*/
  __IO uint32_t AS3;               /*!< EBIF Area and Start Address Configuration Register 3*/
       uint32_t RESERVED1[8];
  __IO uint32_t CS0;               /*!< EBIF Chip Select Control Register 0          */
  __IO uint32_t CS1;               /*!< EBIF Chip Select Control Register 1          */
  __IO uint32_t CS2;               /*!< EBIF Chip Select Control Register 2          */
  __IO uint32_t CS3;               /*!< EBIF Chip Select Control Register 3          */
       uint32_t RESERVED2[4];
  __IO uint32_t CLKCTL;            /*!< EBIF Clock Output Control Register           */
} TSB_EXB_TypeDef;

/**
  * @brief Clock Generator (CG)
  */
typedef struct
{
  __IO uint32_t PROTECT;           /*!< CG write protection register                 */
  __IO uint32_t OSCCR;             /*!< CG Oscillation control register              */
  __IO uint32_t SYSCR;             /*!< CG System clock control register             */
  __IO uint32_t STBYCR;            /*!< CG Standby control register                  */
       uint32_t RESERVED0[4];
  __IO uint32_t PLL0SEL;           /*!< CG PLL selection register for fsys           */
       uint32_t RESERVED1[3];
  __IO uint32_t WUPHCR;            /*!< CG High speed oscillation warming up register*/
  __IO uint32_t WUPLCR;            /*!< CG Low speed oscillation warming up register */
       uint32_t RESERVED2[3];
  __IO uint32_t FSYSMENC;          /*!< CG Middle speed clock supply and stop register C for fsys*/
  __IO uint32_t FSYSMENA;          /*!< CG Middle speed clock supply and stop register A for fsys*/
  __IO uint32_t FSYSMENB;          /*!< CG Middle speed clock supply and stop register B for fsys*/
  __IO uint32_t FSYSENA;           /*!< CG High speed clock supply and stop register A for fsys*/
       uint32_t RESERVED3;
  __IO uint32_t FCEN;              /*!< CG Clock supply and stop register for fc     */
  __IO uint32_t SPCLKEN;           /*!< CG Clock supply for ADC and Trace Register   */
       uint32_t RESERVED4[2];
  __IO uint32_t EXTEND2;           /*!< CG Function extension register 2             */
} TSB_CG_TypeDef;

/**
  * @brief Interrupt Control Register B
  */
typedef struct
{
       uint8_t  RESERVED0[16];
  __IO uint8_t  NIC00;             /*!< Non-maskable Interrupt B Control Register 00 */
       uint8_t  RESERVED1[79];
  __IO uint8_t  IMC000;            /*!< Interrupt B Mode Control Register 000        */
  __IO uint8_t  IMC001;            /*!< Interrupt B Mode Control Register 001        */
  __IO uint8_t  IMC002;            /*!< Interrupt B Mode Control Register 002        */
  __IO uint8_t  IMC003;            /*!< Interrupt B Mode Control Register 003        */
  __IO uint8_t  IMC004;            /*!< Interrupt B Mode Control Register 004        */
  __IO uint8_t  IMC005;            /*!< Interrupt B Mode Control Register 005        */
  __IO uint8_t  IMC006;            /*!< Interrupt B Mode Control Register 006        */
  __IO uint8_t  IMC007;            /*!< Interrupt B Mode Control Register 007        */
  __IO uint8_t  IMC008;            /*!< Interrupt B Mode Control Register 008        */
  __IO uint8_t  IMC009;            /*!< Interrupt B Mode Control Register 009        */
  __IO uint8_t  IMC010;            /*!< Interrupt B Mode Control Register 010        */
  __IO uint8_t  IMC011;            /*!< Interrupt B Mode Control Register 011        */
  __IO uint8_t  IMC012;            /*!< Interrupt B Mode Control Register 012        */
  __IO uint8_t  IMC013;            /*!< Interrupt B Mode Control Register 013        */
  __IO uint8_t  IMC014;            /*!< Interrupt B Mode Control Register 014        */
  __IO uint8_t  IMC015;            /*!< Interrupt B Mode Control Register 015        */
  __IO uint8_t  IMC016;            /*!< Interrupt B Mode Control Register 016        */
  __IO uint8_t  IMC017;            /*!< Interrupt B Mode Control Register 017        */
  __IO uint8_t  IMC018;            /*!< Interrupt B Mode Control Register 018        */
  __IO uint8_t  IMC019;            /*!< Interrupt B Mode Control Register 019        */
  __IO uint8_t  IMC020;            /*!< Interrupt B Mode Control Register 020        */
  __IO uint8_t  IMC021;            /*!< Interrupt B Mode Control Register 021        */
  __IO uint8_t  IMC022;            /*!< Interrupt B Mode Control Register 022        */
  __IO uint8_t  IMC023;            /*!< Interrupt B Mode Control Register 023        */
  __IO uint8_t  IMC024;            /*!< Interrupt B Mode Control Register 024        */
  __IO uint8_t  IMC025;            /*!< Interrupt B Mode Control Register 025        */
  __IO uint8_t  IMC026;            /*!< Interrupt B Mode Control Register 026        */
  __IO uint8_t  IMC027;            /*!< Interrupt B Mode Control Register 027        */
  __IO uint8_t  IMC028;            /*!< Interrupt B Mode Control Register 028        */
  __IO uint8_t  IMC029;            /*!< Interrupt B Mode Control Register 029        */
  __IO uint8_t  IMC030;            /*!< Interrupt B Mode Control Register 030        */
  __IO uint8_t  IMC031;            /*!< Interrupt B Mode Control Register 031        */
  __IO uint8_t  IMC032;            /*!< Interrupt B Mode Control Register 032        */
  __IO uint8_t  IMC033;            /*!< Interrupt B Mode Control Register 033        */
  __IO uint8_t  IMC034;            /*!< Interrupt B Mode Control Register 034        */
  __IO uint8_t  IMC035;            /*!< Interrupt B Mode Control Register 035        */
  __IO uint8_t  IMC036;            /*!< Interrupt B Mode Control Register 036        */
  __IO uint8_t  IMC037;            /*!< Interrupt B Mode Control Register 037        */
  __IO uint8_t  IMC038;            /*!< Interrupt B Mode Control Register 038        */
  __IO uint8_t  IMC039;            /*!< Interrupt B Mode Control Register 039        */
  __IO uint8_t  IMC040;            /*!< Interrupt B Mode Control Register 040        */
  __IO uint8_t  IMC041;            /*!< Interrupt B Mode Control Register 041        */
  __IO uint8_t  IMC042;            /*!< Interrupt B Mode Control Register 042        */
  __IO uint8_t  IMC043;            /*!< Interrupt B Mode Control Register 043        */
  __IO uint8_t  IMC044;            /*!< Interrupt B Mode Control Register 044        */
  __IO uint8_t  IMC045;            /*!< Interrupt B Mode Control Register 045        */
  __IO uint8_t  IMC046;            /*!< Interrupt B Mode Control Register 046        */
  __IO uint8_t  IMC047;            /*!< Interrupt B Mode Control Register 047        */
  __IO uint8_t  IMC048;            /*!< Interrupt B Mode Control Register 048        */
  __IO uint8_t  IMC049;            /*!< Interrupt B Mode Control Register 049        */
  __IO uint8_t  IMC050;            /*!< Interrupt B Mode Control Register 050        */
  __IO uint8_t  IMC051;            /*!< Interrupt B Mode Control Register 051        */
  __IO uint8_t  IMC052;            /*!< Interrupt B Mode Control Register 052        */
  __IO uint8_t  IMC053;            /*!< Interrupt B Mode Control Register 053        */
  __IO uint8_t  IMC054;            /*!< Interrupt B Mode Control Register 054        */
  __IO uint8_t  IMC055;            /*!< Interrupt B Mode Control Register 055        */
  __IO uint8_t  IMC056;            /*!< Interrupt B Mode Control Register 056        */
  __IO uint8_t  IMC057;            /*!< Interrupt B Mode Control Register 057        */
  __IO uint8_t  IMC058;            /*!< Interrupt B Mode Control Register 058        */
  __IO uint8_t  IMC059;            /*!< Interrupt B Mode Control Register 059        */
  __IO uint8_t  IMC060;            /*!< Interrupt B Mode Control Register 060        */
  __IO uint8_t  IMC061;            /*!< Interrupt B Mode Control Register 061        */
  __IO uint8_t  IMC062;            /*!< Interrupt B Mode Control Register 062        */
  __IO uint8_t  IMC063;            /*!< Interrupt B Mode Control Register 063        */
  __IO uint8_t  IMC064;            /*!< Interrupt B Mode Control Register 064        */
  __IO uint8_t  IMC065;            /*!< Interrupt B Mode Control Register 065        */
  __IO uint8_t  IMC066;            /*!< Interrupt B Mode Control Register 066        */
  __IO uint8_t  IMC067;            /*!< Interrupt B Mode Control Register 067        */
  __IO uint8_t  IMC068;            /*!< Interrupt B Mode Control Register 068        */
  __IO uint8_t  IMC069;            /*!< Interrupt B Mode Control Register 069        */
  __IO uint8_t  IMC070;            /*!< Interrupt B Mode Control Register 070        */
  __IO uint8_t  IMC071;            /*!< Interrupt B Mode Control Register 071        */
  __IO uint8_t  IMC072;            /*!< Interrupt B Mode Control Register 072        */
  __IO uint8_t  IMC073;            /*!< Interrupt B Mode Control Register 073        */
  __IO uint8_t  IMC074;            /*!< Interrupt B Mode Control Register 074        */
  __IO uint8_t  IMC075;            /*!< Interrupt B Mode Control Register 075        */
  __IO uint8_t  IMC076;            /*!< Interrupt B Mode Control Register 076        */
  __IO uint8_t  IMC077;            /*!< Interrupt B Mode Control Register 077        */
  __IO uint8_t  IMC078;            /*!< Interrupt B Mode Control Register 078        */
  __IO uint8_t  IMC079;            /*!< Interrupt B Mode Control Register 079        */
  __IO uint8_t  IMC080;            /*!< Interrupt B Mode Control Register 080        */
  __IO uint8_t  IMC081;            /*!< Interrupt B Mode Control Register 081        */
  __IO uint8_t  IMC082;            /*!< Interrupt B Mode Control Register 082        */
  __IO uint8_t  IMC083;            /*!< Interrupt B Mode Control Register 083        */
  __IO uint8_t  IMC084;            /*!< Interrupt B Mode Control Register 084        */
  __IO uint8_t  IMC085;            /*!< Interrupt B Mode Control Register 085        */
  __IO uint8_t  IMC086;            /*!< Interrupt B Mode Control Register 086        */
  __IO uint8_t  IMC087;            /*!< Interrupt B Mode Control Register 087        */
  __IO uint8_t  IMC088;            /*!< Interrupt B Mode Control Register 088        */
  __IO uint8_t  IMC089;            /*!< Interrupt B Mode Control Register 089        */
  __IO uint8_t  IMC090;            /*!< Interrupt B Mode Control Register 090        */
  __IO uint8_t  IMC091;            /*!< Interrupt B Mode Control Register 091        */
  __IO uint8_t  IMC092;            /*!< Interrupt B Mode Control Register 092        */
  __IO uint8_t  IMC093;            /*!< Interrupt B Mode Control Register 093        */
  __IO uint8_t  IMC094;            /*!< Interrupt B Mode Control Register 094        */
  __IO uint8_t  IMC095;            /*!< Interrupt B Mode Control Register 095        */
  __IO uint8_t  IMC096;            /*!< Interrupt B Mode Control Register 096        */
  __IO uint8_t  IMC097;            /*!< Interrupt B Mode Control Register 097        */
  __IO uint8_t  IMC098;            /*!< Interrupt B Mode Control Register 098        */
  __IO uint8_t  IMC099;            /*!< Interrupt B Mode Control Register 099        */
  __IO uint8_t  IMC100;            /*!< Interrupt B Mode Control Register 100        */
  __IO uint8_t  IMC101;            /*!< Interrupt B Mode Control Register 101        */
  __IO uint8_t  IMC102;            /*!< Interrupt B Mode Control Register 102        */
  __IO uint8_t  IMC103;            /*!< Interrupt B Mode Control Register 103        */
  __IO uint8_t  IMC104;            /*!< Interrupt B Mode Control Register 104        */
  __IO uint8_t  IMC105;            /*!< Interrupt B Mode Control Register 105        */
  __IO uint8_t  IMC106;            /*!< Interrupt B Mode Control Register 106        */
  __IO uint8_t  IMC107;            /*!< Interrupt B Mode Control Register 107        */
  __IO uint8_t  IMC108;            /*!< Interrupt B Mode Control Register 108        */
  __IO uint8_t  IMC109;            /*!< Interrupt B Mode Control Register 109        */
  __IO uint8_t  IMC110;            /*!< Interrupt B Mode Control Register 110        */
  __IO uint8_t  IMC111;            /*!< Interrupt B Mode Control Register 111        */
  __IO uint8_t  IMC112;            /*!< Interrupt B Mode Control Register 112        */
  __IO uint8_t  IMC113;            /*!< Interrupt B Mode Control Register 113        */
  __IO uint8_t  IMC114;            /*!< Interrupt B Mode Control Register 114        */
  __IO uint8_t  IMC115;            /*!< Interrupt B Mode Control Register 115        */
  __IO uint8_t  IMC116;            /*!< Interrupt B Mode Control Register 116        */
  __IO uint8_t  IMC117;            /*!< Interrupt B Mode Control Register 117        */
  __IO uint8_t  IMC118;            /*!< Interrupt B Mode Control Register 118        */
  __IO uint8_t  IMC119;            /*!< Interrupt B Mode Control Register 119        */
  __IO uint8_t  IMC120;            /*!< Interrupt B Mode Control Register 120        */
  __IO uint8_t  IMC121;            /*!< Interrupt B Mode Control Register 121        */
  __IO uint8_t  IMC122;            /*!< Interrupt B Mode Control Register 122        */
  __IO uint8_t  IMC123;            /*!< Interrupt B Mode Control Register 123        */
  __IO uint8_t  IMC124;            /*!< Interrupt B Mode Control Register 124        */
  __IO uint8_t  IMC125;            /*!< Interrupt B Mode Control Register 125        */
  __IO uint8_t  IMC126;            /*!< Interrupt B Mode Control Register 126        */
  __IO uint8_t  IMC127;            /*!< Interrupt B Mode Control Register 127        */
  __IO uint8_t  IMC128;            /*!< Interrupt B Mode Control Register 128        */
  __IO uint8_t  IMC129;            /*!< Interrupt B Mode Control Register 129        */
  __IO uint8_t  IMC130;            /*!< Interrupt B Mode Control Register 130        */
  __IO uint8_t  IMC131;            /*!< Interrupt B Mode Control Register 131        */
  __IO uint8_t  IMC132;            /*!< Interrupt B Mode Control Register 132        */
  __IO uint8_t  IMC133;            /*!< Interrupt B Mode Control Register 133        */
  __IO uint8_t  IMC134;            /*!< Interrupt B Mode Control Register 134        */
  __IO uint8_t  IMC135;            /*!< Interrupt B Mode Control Register 135        */
  __IO uint8_t  IMC136;            /*!< Interrupt B Mode Control Register 136        */
  __IO uint8_t  IMC137;            /*!< Interrupt B Mode Control Register 137        */
  __IO uint8_t  IMC138;            /*!< Interrupt B Mode Control Register 138        */
  __IO uint8_t  IMC139;            /*!< Interrupt B Mode Control Register 139        */
  __IO uint8_t  IMC140;            /*!< Interrupt B Mode Control Register 140        */
  __IO uint8_t  IMC141;            /*!< Interrupt B Mode Control Register 141        */
  __IO uint8_t  IMC142;            /*!< Interrupt B Mode Control Register 142        */
  __IO uint8_t  IMC143;            /*!< Interrupt B Mode Control Register 143        */
  __IO uint8_t  IMC144;            /*!< Interrupt B Mode Control Register 144        */
  __IO uint8_t  IMC145;            /*!< Interrupt B Mode Control Register 145        */
  __IO uint8_t  IMC146;            /*!< Interrupt B Mode Control Register 146        */
  __IO uint8_t  IMC147;            /*!< Interrupt B Mode Control Register 147        */
  __IO uint8_t  IMC148;            /*!< Interrupt B Mode Control Register 148        */
  __IO uint8_t  IMC149;            /*!< Interrupt B Mode Control Register 149        */
  __IO uint8_t  IMC150;            /*!< Interrupt B Mode Control Register 150        */
  __IO uint8_t  IMC151;            /*!< Interrupt B Mode Control Register 151        */
  __IO uint8_t  IMC152;            /*!< Interrupt B Mode Control Register 152        */
  __IO uint8_t  IMC153;            /*!< Interrupt B Mode Control Register 153        */
  __IO uint8_t  IMC154;            /*!< Interrupt B Mode Control Register 154        */
  __IO uint8_t  IMC155;            /*!< Interrupt B Mode Control Register 155        */
  __IO uint8_t  IMC156;            /*!< Interrupt B Mode Control Register 156        */
  __IO uint8_t  IMC157;            /*!< Interrupt B Mode Control Register 157        */
  __IO uint8_t  IMC158;            /*!< Interrupt B Mode Control Register 158        */
  __IO uint8_t  IMC159;            /*!< Interrupt B Mode Control Register 159        */
} TSB_IB_TypeDef;

