iarsystems/ewarm-toshiba-example-projects/TMPM4NQ/Libraries/TMPM4NN.h
#define TSB_DMACA_BASE             (PERI_BASE  + 0x0000000UL)
#define TSB_DMACB_BASE             (PERI_BASE  + 0x0001000UL)
#define TSB_CANAMB0_BASE           (PERI_BASE  + 0x0005000UL)
#define TSB_CANAMB1_BASE           (PERI_BASE  + 0x0005020UL)
#define TSB_CANAMB2_BASE           (PERI_BASE  + 0x0005040UL)
#define TSB_CANAMB3_BASE           (PERI_BASE  + 0x0005060UL)
#define TSB_CANAMB4_BASE           (PERI_BASE  + 0x0005080UL)
#define TSB_CANAMB5_BASE           (PERI_BASE  + 0x00050A0UL)
#define TSB_CANAMB6_BASE           (PERI_BASE  + 0x00050C0UL)
#define TSB_CANAMB7_BASE           (PERI_BASE  + 0x00050E0UL)
#define TSB_CANAMB8_BASE           (PERI_BASE  + 0x0005100UL)
#define TSB_CANAMB9_BASE           (PERI_BASE  + 0x0005120UL)
#define TSB_CANAMB10_BASE          (PERI_BASE  + 0x0005140UL)
#define TSB_CANAMB11_BASE          (PERI_BASE  + 0x0005160UL)
#define TSB_CANAMB12_BASE          (PERI_BASE  + 0x0005180UL)
#define TSB_CANAMB13_BASE          (PERI_BASE  + 0x00051A0UL)
#define TSB_CANAMB14_BASE          (PERI_BASE  + 0x00051C0UL)
#define TSB_CANAMB15_BASE          (PERI_BASE  + 0x00051E0UL)
#define TSB_CANAMB16_BASE          (PERI_BASE  + 0x0005200UL)
#define TSB_CANAMB17_BASE          (PERI_BASE  + 0x0005220UL)
#define TSB_CANAMB18_BASE          (PERI_BASE  + 0x0005240UL)
#define TSB_CANAMB19_BASE          (PERI_BASE  + 0x0005260UL)
#define TSB_CANAMB20_BASE          (PERI_BASE  + 0x0005280UL)
#define TSB_CANAMB21_BASE          (PERI_BASE  + 0x00052A0UL)
#define TSB_CANAMB22_BASE          (PERI_BASE  + 0x00052C0UL)
#define TSB_CANAMB23_BASE          (PERI_BASE  + 0x00052E0UL)
#define TSB_CANAMB24_BASE          (PERI_BASE  + 0x0005300UL)
#define TSB_CANAMB25_BASE          (PERI_BASE  + 0x0005320UL)
#define TSB_CANAMB26_BASE          (PERI_BASE  + 0x0005340UL)
#define TSB_CANAMB27_BASE          (PERI_BASE  + 0x0005360UL)
#define TSB_CANAMB28_BASE          (PERI_BASE  + 0x0005380UL)
#define TSB_CANAMB29_BASE          (PERI_BASE  + 0x00053A0UL)
#define TSB_CANAMB30_BASE          (PERI_BASE  + 0x00053C0UL)
#define TSB_CANAMB31_BASE          (PERI_BASE  + 0x00053E0UL)
#define TSB_CANBMB0_BASE           (PERI_BASE  + 0x0006000UL)
#define TSB_CANBMB1_BASE           (PERI_BASE  + 0x0006020UL)
#define TSB_CANBMB2_BASE           (PERI_BASE  + 0x0006040UL)
#define TSB_CANBMB3_BASE           (PERI_BASE  + 0x0006060UL)
#define TSB_CANBMB4_BASE           (PERI_BASE  + 0x0006080UL)
#define TSB_CANBMB5_BASE           (PERI_BASE  + 0x00060A0UL)
#define TSB_CANBMB6_BASE           (PERI_BASE  + 0x00060C0UL)
#define TSB_CANBMB7_BASE           (PERI_BASE  + 0x00060E0UL)
#define TSB_CANBMB8_BASE           (PERI_BASE  + 0x0006100UL)
#define TSB_CANBMB9_BASE           (PERI_BASE  + 0x0006120UL)
#define TSB_CANBMB10_BASE          (PERI_BASE  + 0x0006140UL)
#define TSB_CANBMB11_BASE          (PERI_BASE  + 0x0006160UL)
#define TSB_CANBMB12_BASE          (PERI_BASE  + 0x0006180UL)
#define TSB_CANBMB13_BASE          (PERI_BASE  + 0x00061A0UL)
#define TSB_CANBMB14_BASE          (PERI_BASE  + 0x00061C0UL)
#define TSB_CANBMB15_BASE          (PERI_BASE  + 0x00061E0UL)
#define TSB_CANBMB16_BASE          (PERI_BASE  + 0x0006200UL)
#define TSB_CANBMB17_BASE          (PERI_BASE  + 0x0006220UL)
#define TSB_CANBMB18_BASE          (PERI_BASE  + 0x0006240UL)
#define TSB_CANBMB19_BASE          (PERI_BASE  + 0x0006260UL)
#define TSB_CANBMB20_BASE          (PERI_BASE  + 0x0006280UL)
#define TSB_CANBMB21_BASE          (PERI_BASE  + 0x00062A0UL)
#define TSB_CANBMB22_BASE          (PERI_BASE  + 0x00062C0UL)
#define TSB_CANBMB23_BASE          (PERI_BASE  + 0x00062E0UL)
#define TSB_CANBMB24_BASE          (PERI_BASE  + 0x0006300UL)
#define TSB_CANBMB25_BASE          (PERI_BASE  + 0x0006320UL)
#define TSB_CANBMB26_BASE          (PERI_BASE  + 0x0006340UL)
#define TSB_CANBMB27_BASE          (PERI_BASE  + 0x0006360UL)
#define TSB_CANBMB28_BASE          (PERI_BASE  + 0x0006380UL)
#define TSB_CANBMB29_BASE          (PERI_BASE  + 0x00063A0UL)
#define TSB_CANBMB30_BASE          (PERI_BASE  + 0x00063C0UL)
#define TSB_CANBMB31_BASE          (PERI_BASE  + 0x00063E0UL)
#define TSB_CANA_BASE              (PERI_BASE  + 0x0005400UL)
#define TSB_CANB_BASE              (PERI_BASE  + 0x0006400UL)
#define TSB_EMA_BASE               (PERI_BASE  + 0x000A000UL)
#define TSB_SMI0_BASE              (PERI_BASE  + 0x000C000UL)
#define TSB_IA_BASE                (PERI_BASE  + 0x003E000UL)
#define TSB_RLM_BASE               (PERI_BASE  + 0x003E400UL)
#define TSB_LVD_BASE               (PERI_BASE  + 0x003EC00UL)
#define TSB_TSEL0_BASE             (PERI_BASE  + 0x00A0400UL)
#define TSB_LTT0_BASE              (PERI_BASE  + 0x003FF00UL)
#define TSB_TSPI0_BASE             (PERI_BASE  + 0x006A000UL)
#define TSB_TSPI1_BASE             (PERI_BASE  + 0x006A400UL)
#define TSB_TSPI2_BASE             (PERI_BASE  + 0x006A800UL)
#define TSB_TSPI3_BASE             (PERI_BASE  + 0x006AC00UL)
#define TSB_TSPI4_BASE             (PERI_BASE  + 0x006B000UL)
#define TSB_EXB_BASE               (PERI_BASE  + 0x0076000UL)
#define TSB_CG_BASE                (PERI_BASE  + 0x0083000UL)
#define TSB_IB_BASE                (PERI_BASE  + 0x0083200UL)
#define TSB_IMN_BASE               (PERI_BASE  + 0x0083300UL)
#define TSB_DNFA_BASE              (PERI_BASE  + 0x00A0200UL)
#define TSB_DNFB_BASE              (PERI_BASE  + 0x00A0300UL)
#define TSB_SIWD0_BASE             (PERI_BASE  + 0x00A0600UL)
#define TSB_NBD_BASE               (PERI_BASE  + 0x00A2000UL)
#define TSB_MDMAA_BASE             (PERI_BASE  + 0x00A4000UL)
#define TSB_FURT0_BASE             (PERI_BASE  + 0x00A8000UL)
#define TSB_ADA_BASE               (PERI_BASE  + 0x00BA000UL)
#define TSB_DA0_BASE               (PERI_BASE  + 0x00BC800UL)
#define TSB_DA1_BASE               (PERI_BASE  + 0x00BC900UL)
#define TSB_T32A0_BASE             (PERI_BASE  + 0x00C1000UL)
#define TSB_T32A1_BASE             (PERI_BASE  + 0x00C1400UL)
#define TSB_T32A2_BASE             (PERI_BASE  + 0x00C1800UL)
#define TSB_T32A3_BASE             (PERI_BASE  + 0x00C1C00UL)
#define TSB_T32A4_BASE             (PERI_BASE  + 0x00C2000UL)
#define TSB_T32A5_BASE             (PERI_BASE  + 0x00C2400UL)
#define TSB_T32A6_BASE             (PERI_BASE  + 0x00C2800UL)
#define TSB_T32A7_BASE             (PERI_BASE  + 0x00C2C00UL)
#define TSB_T32A8_BASE             (PERI_BASE  + 0x00C3000UL)
#define TSB_T32A9_BASE             (PERI_BASE  + 0x00C3400UL)
#define TSB_T32A10_BASE            (PERI_BASE  + 0x00C3800UL)
#define TSB_T32A11_BASE            (PERI_BASE  + 0x00C3C00UL)
#define TSB_T32A12_BASE            (PERI_BASE  + 0x00C4000UL)
#define TSB_T32A13_BASE            (PERI_BASE  + 0x00C4400UL)
#define TSB_T32A14_BASE            (PERI_BASE  + 0x00C4800UL)
#define TSB_T32A15_BASE            (PERI_BASE  + 0x00C4C00UL)
#define TSB_TSSI0_BASE             (PERI_BASE  + 0x00CD000UL)
#define TSB_UART0_BASE             (PERI_BASE  + 0x00CE000UL)
#define TSB_UART1_BASE             (PERI_BASE  + 0x00CE400UL)
#define TSB_UART2_BASE             (PERI_BASE  + 0x00CE800UL)
#define TSB_I2S0_BASE              (PERI_BASE  + 0x00D0000UL)
#define TSB_I2S1_BASE              (PERI_BASE  + 0x00D0800UL)
#define TSB_I2C0_BASE              (PERI_BASE  + 0x00D1000UL)
#define TSB_I2C1_BASE              (PERI_BASE  + 0x00D2000UL)
#define TSB_I2C2_BASE              (PERI_BASE  + 0x00D3000UL)
#define TSB_EI2C0_BASE             (PERI_BASE  + 0x00D8000UL)
#define TSB_EI2C1_BASE             (PERI_BASE  + 0x00D9000UL)
#define TSB_EI2C2_BASE             (PERI_BASE  + 0x00DA000UL)
#define TSB_FIRnore_BASE           (PERI_BASE  + 0x00DD000UL)
#define TSB_PA_BASE                (PERI_BASE  + 0x00E0000UL)
#define TSB_PB_BASE                (PERI_BASE  + 0x00E0100UL)
#define TSB_PC_BASE                (PERI_BASE  + 0x00E0200UL)
#define TSB_PD_BASE                (PERI_BASE  + 0x00E0300UL)
#define TSB_PE_BASE                (PERI_BASE  + 0x00E0400UL)
#define TSB_PF_BASE                (PERI_BASE  + 0x00E0500UL)
#define TSB_PG_BASE                (PERI_BASE  + 0x00E0600UL)
#define TSB_PH_BASE                (PERI_BASE  + 0x00E0700UL)
#define TSB_PK_BASE                (PERI_BASE  + 0x00E0900UL)
#define TSB_PL_BASE                (PERI_BASE  + 0x00E0A00UL)
#define TSB_PN_BASE                (PERI_BASE  + 0x00E0C00UL)
#define TSB_PP_BASE                (PERI_BASE  + 0x00E0D00UL)
#define TSB_PR_BASE                (PERI_BASE  + 0x00E0E00UL)
#define TSB_PT_BASE                (PERI_BASE  + 0x00E0F00UL)
#define TSB_PY_BASE                (PERI_BASE  + 0x00E1300UL)
#define TSB_TRM_BASE               (PERI_BASE  + 0x00E3100UL)
#define TSB_OFD_BASE               (PERI_BASE  + 0x00E4000UL)
#define TSB_RTC_BASE               (PERI_BASE  + 0x00E4800UL)
#define TSB_RMC0_BASE              (PERI_BASE  + 0x00E8100UL)
#define TSB_PMD0_BASE              (PERI_BASE  + 0x00E9000UL)
#define TSB_ISDA_BASE              (PERI_BASE  + 0x00F0000UL)
#define TSB_USBA_BASE              (PERI_BASE  + 0x0100000UL)
#define TSB_FC_BASE                (PERI_BASE  + 0x1DFF0000UL)


