iarsystems/ewarm-toshiba-example-projects/TMPM4NQ/Libraries/TMPM4NN.h
#define TSB_CANAMB1_ID_RFH                        (*((__IO uint32_t *)BITBAND_PERI(&TSB_CANAMB1->ID,29)))
#define TSB_CANAMB1_ID_GAME_LAME                  (*((__IO uint32_t *)BITBAND_PERI(&TSB_CANAMB1->ID,30)))
#define TSB_CANAMB1_ID_IDE                        (*((__IO uint32_t *)BITBAND_PERI(&TSB_CANAMB1->ID,31)))
#define TSB_CANAMB1_TSVMCF_RTR                    (*((__IO uint32_t *)BITBAND_PERI(&TSB_CANAMB1->TSVMCF,4)))

#define TSB_CANAMB2_ID_RFH                        (*((__IO uint32_t *)BITBAND_PERI(&TSB_CANAMB2->ID,29)))
#define TSB_CANAMB2_ID_GAME_LAME                  (*((__IO uint32_t *)BITBAND_PERI(&TSB_CANAMB2->ID,30)))
#define TSB_CANAMB2_ID_IDE                        (*((__IO uint32_t *)BITBAND_PERI(&TSB_CANAMB2->ID,31)))
#define TSB_CANAMB2_TSVMCF_RTR                    (*((__IO uint32_t *)BITBAND_PERI(&TSB_CANAMB2->TSVMCF,4)))

#define TSB_CANAMB3_ID_RFH                        (*((__IO uint32_t *)BITBAND_PERI(&TSB_CANAMB3->ID,29)))
#define TSB_CANAMB3_ID_GAME_LAME                  (*((__IO uint32_t *)BITBAND_PERI(&TSB_CANAMB3->ID,30)))
#define TSB_CANAMB3_ID_IDE                        (*((__IO uint32_t *)BITBAND_PERI(&TSB_CANAMB3->ID,31)))
#define TSB_CANAMB3_TSVMCF_RTR                    (*((__IO uint32_t *)BITBAND_PERI(&TSB_CANAMB3->TSVMCF,4)))

#define TSB_CANAMB4_ID_RFH                        (*((__IO uint32_t *)BITBAND_PERI(&TSB_CANAMB4->ID,29)))
#define TSB_CANAMB4_ID_GAME_LAME                  (*((__IO uint32_t *)BITBAND_PERI(&TSB_CANAMB4->ID,30)))
#define TSB_CANAMB4_ID_IDE                        (*((__IO uint32_t *)BITBAND_PERI(&TSB_CANAMB4->ID,31)))
#define TSB_CANAMB4_TSVMCF_RTR                    (*((__IO uint32_t *)BITBAND_PERI(&TSB_CANAMB4->TSVMCF,4)))

#define TSB_CANAMB5_ID_RFH                        (*((__IO uint32_t *)BITBAND_PERI(&TSB_CANAMB5->ID,29)))
#define TSB_CANAMB5_ID_GAME_LAME                  (*((__IO uint32_t *)BITBAND_PERI(&TSB_CANAMB5->ID,30)))
#define TSB_CANAMB5_ID_IDE                        (*((__IO uint32_t *)BITBAND_PERI(&TSB_CANAMB5->ID,31)))
#define TSB_CANAMB5_TSVMCF_RTR                    (*((__IO uint32_t *)BITBAND_PERI(&TSB_CANAMB5->TSVMCF,4)))

#define TSB_CANAMB6_ID_RFH                        (*((__IO uint32_t *)BITBAND_PERI(&TSB_CANAMB6->ID,29)))
#define TSB_CANAMB6_ID_GAME_LAME                  (*((__IO uint32_t *)BITBAND_PERI(&TSB_CANAMB6->ID,30)))
#define TSB_CANAMB6_ID_IDE                        (*((__IO uint32_t *)BITBAND_PERI(&TSB_CANAMB6->ID,31)))
#define TSB_CANAMB6_TSVMCF_RTR                    (*((__IO uint32_t *)BITBAND_PERI(&TSB_CANAMB6->TSVMCF,4)))

#define TSB_CANAMB7_ID_RFH                        (*((__IO uint32_t *)BITBAND_PERI(&TSB_CANAMB7->ID,29)))
#define TSB_CANAMB7_ID_GAME_LAME                  (*((__IO uint32_t *)BITBAND_PERI(&TSB_CANAMB7->ID,30)))
#define TSB_CANAMB7_ID_IDE                        (*((__IO uint32_t *)BITBAND_PERI(&TSB_CANAMB7->ID,31)))
#define TSB_CANAMB7_TSVMCF_RTR                    (*((__IO uint32_t *)BITBAND_PERI(&TSB_CANAMB7->TSVMCF,4)))

#define TSB_CANAMB8_ID_RFH                        (*((__IO uint32_t *)BITBAND_PERI(&TSB_CANAMB8->ID,29)))
#define TSB_CANAMB8_ID_GAME_LAME                  (*((__IO uint32_t *)BITBAND_PERI(&TSB_CANAMB8->ID,30)))
#define TSB_CANAMB8_ID_IDE                        (*((__IO uint32_t *)BITBAND_PERI(&TSB_CANAMB8->ID,31)))
#define TSB_CANAMB8_TSVMCF_RTR                    (*((__IO uint32_t *)BITBAND_PERI(&TSB_CANAMB8->TSVMCF,4)))

#define TSB_CANAMB9_ID_RFH                        (*((__IO uint32_t *)BITBAND_PERI(&TSB_CANAMB9->ID,29)))
#define TSB_CANAMB9_ID_GAME_LAME                  (*((__IO uint32_t *)BITBAND_PERI(&TSB_CANAMB9->ID,30)))
#define TSB_CANAMB9_ID_IDE                        (*((__IO uint32_t *)BITBAND_PERI(&TSB_CANAMB9->ID,31)))
#define TSB_CANAMB9_TSVMCF_RTR                    (*((__IO uint32_t *)BITBAND_PERI(&TSB_CANAMB9->TSVMCF,4)))

#define TSB_CANAMB10_ID_RFH                       (*((__IO uint32_t *)BITBAND_PERI(&TSB_CANAMB10->ID,29)))
#define TSB_CANAMB10_ID_GAME_LAME                 (*((__IO uint32_t *)BITBAND_PERI(&TSB_CANAMB10->ID,30)))
#define TSB_CANAMB10_ID_IDE                       (*((__IO uint32_t *)BITBAND_PERI(&TSB_CANAMB10->ID,31)))
#define TSB_CANAMB10_TSVMCF_RTR                   (*((__IO uint32_t *)BITBAND_PERI(&TSB_CANAMB10->TSVMCF,4)))

#define TSB_CANAMB11_ID_RFH                       (*((__IO uint32_t *)BITBAND_PERI(&TSB_CANAMB11->ID,29)))
#define TSB_CANAMB11_ID_GAME_LAME                 (*((__IO uint32_t *)BITBAND_PERI(&TSB_CANAMB11->ID,30)))
#define TSB_CANAMB11_ID_IDE                       (*((__IO uint32_t *)BITBAND_PERI(&TSB_CANAMB11->ID,31)))
#define TSB_CANAMB11_TSVMCF_RTR                   (*((__IO uint32_t *)BITBAND_PERI(&TSB_CANAMB11->TSVMCF,4)))

#define TSB_CANAMB12_ID_RFH                       (*((__IO uint32_t *)BITBAND_PERI(&TSB_CANAMB12->ID,29)))
#define TSB_CANAMB12_ID_GAME_LAME                 (*((__IO uint32_t *)BITBAND_PERI(&TSB_CANAMB12->ID,30)))
#define TSB_CANAMB12_ID_IDE                       (*((__IO uint32_t *)BITBAND_PERI(&TSB_CANAMB12->ID,31)))
#define TSB_CANAMB12_TSVMCF_RTR                   (*((__IO uint32_t *)BITBAND_PERI(&TSB_CANAMB12->TSVMCF,4)))

#define TSB_CANAMB13_ID_RFH                       (*((__IO uint32_t *)BITBAND_PERI(&TSB_CANAMB13->ID,29)))
#define TSB_CANAMB13_ID_GAME_LAME                 (*((__IO uint32_t *)BITBAND_PERI(&TSB_CANAMB13->ID,30)))
#define TSB_CANAMB13_ID_IDE                       (*((__IO uint32_t *)BITBAND_PERI(&TSB_CANAMB13->ID,31)))
#define TSB_CANAMB13_TSVMCF_RTR                   (*((__IO uint32_t *)BITBAND_PERI(&TSB_CANAMB13->TSVMCF,4)))

#define TSB_CANAMB14_ID_RFH                       (*((__IO uint32_t *)BITBAND_PERI(&TSB_CANAMB14->ID,29)))
#define TSB_CANAMB14_ID_GAME_LAME                 (*((__IO uint32_t *)BITBAND_PERI(&TSB_CANAMB14->ID,30)))
#define TSB_CANAMB14_ID_IDE                       (*((__IO uint32_t *)BITBAND_PERI(&TSB_CANAMB14->ID,31)))
#define TSB_CANAMB14_TSVMCF_RTR                   (*((__IO uint32_t *)BITBAND_PERI(&TSB_CANAMB14->TSVMCF,4)))

#define TSB_CANAMB15_ID_RFH                       (*((__IO uint32_t *)BITBAND_PERI(&TSB_CANAMB15->ID,29)))
#define TSB_CANAMB15_ID_GAME_LAME                 (*((__IO uint32_t *)BITBAND_PERI(&TSB_CANAMB15->ID,30)))
#define TSB_CANAMB15_ID_IDE                       (*((__IO uint32_t *)BITBAND_PERI(&TSB_CANAMB15->ID,31)))
#define TSB_CANAMB15_TSVMCF_RTR                   (*((__IO uint32_t *)BITBAND_PERI(&TSB_CANAMB15->TSVMCF,4)))

#define TSB_CANAMB16_ID_RFH                       (*((__IO uint32_t *)BITBAND_PERI(&TSB_CANAMB16->ID,29)))
#define TSB_CANAMB16_ID_GAME_LAME                 (*((__IO uint32_t *)BITBAND_PERI(&TSB_CANAMB16->ID,30)))
#define TSB_CANAMB16_ID_IDE                       (*((__IO uint32_t *)BITBAND_PERI(&TSB_CANAMB16->ID,31)))
#define TSB_CANAMB16_TSVMCF_RTR                   (*((__IO uint32_t *)BITBAND_PERI(&TSB_CANAMB16->TSVMCF,4)))

#define TSB_CANAMB17_ID_RFH                       (*((__IO uint32_t *)BITBAND_PERI(&TSB_CANAMB17->ID,29)))
#define TSB_CANAMB17_ID_GAME_LAME                 (*((__IO uint32_t *)BITBAND_PERI(&TSB_CANAMB17->ID,30)))
#define TSB_CANAMB17_ID_IDE                       (*((__IO uint32_t *)BITBAND_PERI(&TSB_CANAMB17->ID,31)))
#define TSB_CANAMB17_TSVMCF_RTR                   (*((__IO uint32_t *)BITBAND_PERI(&TSB_CANAMB17->TSVMCF,4)))

